nrf-rs/nrf52832-pac/nrf52832_fixed.svd
          <register>
            <name>SUBS</name>
            <description>Description cluster[0]:  Subregions of region 0</description>
            <addressOffset>0x008</addressOffset>
            <access>read-write</access>
            <resetValue>0x00000000</resetValue>
            <fields>
              <field>
                <name>SR0</name>
                <description>Include or exclude subregion 0 in region</description>
                <lsb>0</lsb>
                <msb>0</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Exclude</name>
                    <description>Exclude</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>Include</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR1</name>
                <description>Include or exclude subregion 1 in region</description>
                <lsb>1</lsb>
                <msb>1</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Exclude</name>
                    <description>Exclude</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>Include</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR2</name>
                <description>Include or exclude subregion 2 in region</description>
                <lsb>2</lsb>
                <msb>2</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Exclude</name>
                    <description>Exclude</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>Include</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR3</name>
                <description>Include or exclude subregion 3 in region</description>
                <lsb>3</lsb>
                <msb>3</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Exclude</name>
                    <description>Exclude</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>Include</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR4</name>
                <description>Include or exclude subregion 4 in region</description>
                <lsb>4</lsb>
                <msb>4</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Exclude</name>
                    <description>Exclude</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>Include</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR5</name>
                <description>Include or exclude subregion 5 in region</description>
                <lsb>5</lsb>
                <msb>5</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Exclude</name>
                    <description>Exclude</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>Include</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR6</name>
                <description>Include or exclude subregion 6 in region</description>
                <lsb>6</lsb>
                <msb>6</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Exclude</name>
                    <description>Exclude</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>Include</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR7</name>
                <description>Include or exclude subregion 7 in region</description>
                <lsb>7</lsb>
                <msb>7</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Exclude</name>
                    <description>Exclude</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>Include</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR8</name>
                <description>Include or exclude subregion 8 in region</description>
                <lsb>8</lsb>
                <msb>8</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Exclude</name>
                    <description>Exclude</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>Include</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR9</name>
                <description>Include or exclude subregion 9 in region</description>
                <lsb>9</lsb>
                <msb>9</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Exclude</name>
                    <description>Exclude</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>Include</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR10</name>
                <description>Include or exclude subregion 10 in region</description>
                <lsb>10</lsb>
                <msb>10</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Exclude</name>
                    <description>Exclude</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>Include</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR11</name>
                <description>Include or exclude subregion 11 in region</description>
                <lsb>11</lsb>
                <msb>11</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Exclude</name>
                    <description>Exclude</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>Include</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR12</name>
                <description>Include or exclude subregion 12 in region</description>
                <lsb>12</lsb>
                <msb>12</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Exclude</name>
                    <description>Exclude</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>Include</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR13</name>
                <description>Include or exclude subregion 13 in region</description>
                <lsb>13</lsb>
                <msb>13</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Exclude</name>
                    <description>Exclude</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>Include</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR14</name>
                <description>Include or exclude subregion 14 in region</description>
                <lsb>14</lsb>
                <msb>14</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Exclude</name>
                    <description>Exclude</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>Include</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR15</name>
                <description>Include or exclude subregion 15 in region</description>
                <lsb>15</lsb>
                <msb>15</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Exclude</name>
                    <description>Exclude</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>Include</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR16</name>
                <description>Include or exclude subregion 16 in region</description>
                <lsb>16</lsb>
                <msb>16</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Exclude</name>
                    <description>Exclude</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>Include</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR17</name>
                <description>Include or exclude subregion 17 in region</description>
                <lsb>17</lsb>
                <msb>17</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Exclude</name>
                    <description>Exclude</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>Include</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR18</name>
                <description>Include or exclude subregion 18 in region</description>
                <lsb>18</lsb>
                <msb>18</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Exclude</name>
                    <description>Exclude</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>Include</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR19</name>
                <description>Include or exclude subregion 19 in region</description>
                <lsb>19</lsb>
                <msb>19</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Exclude</name>
                    <description>Exclude</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>Include</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR20</name>
                <description>Include or exclude subregion 20 in region</description>
                <lsb>20</lsb>
                <msb>20</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Exclude</name>
                    <description>Exclude</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>Include</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR21</name>
                <description>Include or exclude subregion 21 in region</description>
                <lsb>21</lsb>
                <msb>21</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Exclude</name>
                    <description>Exclude</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>Include</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR22</name>
                <description>Include or exclude subregion 22 in region</description>
                <lsb>22</lsb>
                <msb>22</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Exclude</name>
                    <description>Exclude</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>Include</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR23</name>
                <description>Include or exclude subregion 23 in region</description>
                <lsb>23</lsb>
                <msb>23</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Exclude</name>
                    <description>Exclude</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>Include</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR24</name>
                <description>Include or exclude subregion 24 in region</description>
                <lsb>24</lsb>
                <msb>24</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Exclude</name>
                    <description>Exclude</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>Include</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR25</name>
                <description>Include or exclude subregion 25 in region</description>
                <lsb>25</lsb>
                <msb>25</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Exclude</name>
                    <description>Exclude</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>Include</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR26</name>
                <description>Include or exclude subregion 26 in region</description>
                <lsb>26</lsb>
                <msb>26</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Exclude</name>
                    <description>Exclude</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>Include</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR27</name>
                <description>Include or exclude subregion 27 in region</description>
                <lsb>27</lsb>
                <msb>27</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Exclude</name>
                    <description>Exclude</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>Include</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR28</name>
                <description>Include or exclude subregion 28 in region</description>
                <lsb>28</lsb>
                <msb>28</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Exclude</name>
                    <description>Exclude</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>Include</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR29</name>
                <description>Include or exclude subregion 29 in region</description>
                <lsb>29</lsb>
                <msb>29</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Exclude</name>
                    <description>Exclude</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>Include</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR30</name>
                <description>Include or exclude subregion 30 in region</description>
                <lsb>30</lsb>
                <msb>30</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Exclude</name>
                    <description>Exclude</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>Include</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
              <field>
                <name>SR31</name>
                <description>Include or exclude subregion 31 in region</description>
                <lsb>31</lsb>
                <msb>31</msb>
                <enumeratedValues>
                  <enumeratedValue>
                    <name>Exclude</name>
                    <description>Exclude</description>
                    <value>0</value>
                  </enumeratedValue>
                  <enumeratedValue>
                    <name>Include</name>
                    <description>Include</description>
                    <value>1</value>
                  </enumeratedValue>
                </enumeratedValues>
              </field>
            </fields>
          </register>
        </cluster>
